tests/performance/users.yaml
config:
  target: "http://localhost:4000/"
  phases:
    - duration: 60
      arrivalRate: 25
  processor: "./user-functions.js"

scenarios:
  - name: "Fetch user data"
    flow:
      - post:
          url: "/"
          json:
            query: |
              query UsersQuery {
                users(limit: 100) {
                  id
                  username
                  email
                }
              }
          capture:
            json: "$.data.users"
            as: "users"

      - loop:
          - post:
              url: "/"
              beforeRequest: "selectRandomUserId"
              json:
                query: |
                  query UserQuery($userId: ID!) {
                    user(id: $userId) {
                      id
                      username
                      email
                    }
                  }
                variables:
                  userId: "{{ selectedUser.id }}"
        count: 10